window.about = {
    img: "images/my.jpg",
    title: "Обо мне",
    text: "\
    Я начинающий фронтенд-разработчик с базовыми знаниями HTML, CSS и JavaScript, с первым опытом работы с Angular. \
    За короткий срок сделал несколько сайтов — от точной вёрстки макета Figma до собственного портфолио — и понял, \
    что мне действительно интересно создавать работающие интерфейсы. Пока коммерческого опыта у меня нет, но я активно учусь, \
    развиваюсь и стремлюсь расти до уровня senior или даже full-stack разработчика. Работаю в VSCode, выкладываю проекты на GitHub, \
    проверяю адаптивность через DevTools и на реальных устройствах. Люблю планировать проекты заранее, стараюсь писать чистый и структурированный код, \
    при сложных задачах ищу решение самостоятельно, а AI использую как подсказку или для направления, чтобы лучше разбираться в ошибках.\
    <br>\
    Мои сильные стороны — любопытство, дисциплина, желание доводить проекты до конца и решать проблемы, \
    а также коммуникабельность: я не боюсь спрашивать совета у опытных коллег или наставников. Для меня важны аккуратность, \
    понимание логики интерфейсов и постепенный рост: каждый проект — шаг к более сложным задачам и глубокому освоению фронтенда."
}