window.projects = [
    {
        img: "images/intensive.png",
        title: "Аренда премиальных автомобилей — версия 1",
        description: "\
        Первый полноценный веб-проект. Я создал каталог премиальных автомобилей с фильтрацией и формой бронирования. \
        Angular был новым для меня: проект помог освоить компоненты, маршрутизацию и работу с TypeScript. \
        Интересно было наблюдать, как данные оживают на странице при работе фильтров. \
        Есть небольшой баг: при загрузке страницы список машин сначала пуст, но планирую его исправить по мере роста навыков. \
        Проект позволил перейти от теории к практике и закрепить понимание создания работающих веб-приложений.\
        ",
        link: "https://olegiosorokin.github.io/cars/"
    },
  {
        img: "images/first.png",
        title: "Аренда премиальных автомобилей — версия 2",
        description: "\
        Вторая версия сайта стала шагом к более глубокому пониманию фронтенда. \
        Проект выполнен на чистом HTML, CSS и JavaScript, с обновлённой цветовой схемой, улучшенной навигацией и модальным окном для бронирования. \
        Интерфейс упрощён, акцент сделан на визуальном восприятии контента, и полностью адаптирован под мобильные устройства. \
        Проект дал опыт работы с CSS, JavaScript и адаптивным дизайном, а также навыки структурирования кода через функциональные блоки. \
        Этот опыт окончательно подтвердил интерес к фронтенду и желание создавать логичные и удобные интерфейсы.\
        ",
        link: "https://olegiosorokin.github.io/first/"
    },
    {
        img: "images/resume.png",
        title: "Personal Resume",
        description: "\
        Проект стал первым опытом точной вёрстки по макету из Figma. \
        От JavaScript и сторонних библиотек я сознательно отказался, чтобы полностью сосредоточиться на HTML и CSS. \
        Макет был воспроизведён «пиксель в пиксель», с семантической структурой и адаптивностью для мобильных устройств. \
        Основную часть кода я писал вручную, что позволило глубоко понять, как создаётся точный и аккуратный интерфейс. \
        Проект дал фундаментальные навыки вёрстки и работу с макетами, которые пригодятся в более сложных проектах.",
        link: "https://olegiosorokin.github.io/Personal-Resume/"
    }

];